CSI API ETABS v1
cPropMaterial.GetTypeOAPI Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeOAPI(
	string Name,
	ref eMatType MatType,
	ref int SymType
)
Function GetTypeOAPI (
	Name As String,
	ByRef MatType As eMatType,
	ByRef SymType As Integer
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim MatType As eMatType
Dim SymType As Integer
Dim returnValue As Integer
returnValue = instance.GetTypeOAPI(Name,
	MatType, SymType)
int GetTypeOAPI(
	String^ Name,
	eMatType% MatType,
	int% SymType
)
abstract GetTypeOAPI :
        Name : string *
        MatType : eMatType byref *
        SymType : int byref -> int
Parameters
Name
Type: System.String
MatType
Type: ETABSv1.eMatType
SymType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace